vovan888/ArduinoCore-GD32/variants/BIGTREE_GD_TFT35_E3_V3_0/PeripheralPins.c
/* mbed Microcontroller Library
 * Copyright (c) 2018 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"


/*  void pin_function(PinName pin, int function);
    configure the speed, mode,and remap function of pins
    the parameter function contains the configuration information,show as below
    bit 0:2   gpio mode
    bit 3:8   remap
    bit 9:10  gpio speed
    bit 11:15 adc  /timer channel
*/
const int GD_GPIO_REMAP[] = {
        0x00000000,
        GPIO_SPI0_REMAP,               /* 1 */
        GPIO_I2C0_REMAP,               /* 2 */
        GPIO_USART0_REMAP,             /* 3 */
        GPIO_USART1_REMAP,             /* 4 */
        GPIO_USART2_PARTIAL_REMAP,     /* 5 */
        GPIO_USART2_FULL_REMAP,        /* 6 */
        GPIO_TIMER0_PARTIAL_REMAP,     /* 7 */
        GPIO_TIMER0_FULL_REMAP,        /* 8 */
        GPIO_TIMER1_PARTIAL_REMAP0,    /* 9 */
        GPIO_TIMER1_PARTIAL_REMAP1,    /* 10 */
        GPIO_TIMER1_FULL_REMAP,        /* 11 */
        GPIO_TIMER2_PARTIAL_REMAP,     /* 12 */
        GPIO_TIMER2_FULL_REMAP,        /* 13 */
        GPIO_TIMER3_REMAP,             /* 14 */
        GPIO_CAN0_PARTIAL_REMAP,       /* 15 */
        GPIO_CAN0_FULL_REMAP,          /* 16 */
        GPIO_PD01_REMAP,               /* 17 */
        GPIO_TIMER4CH3_IREMAP,         /* 18 */
        GPIO_ADC0_ETRGINS_REMAP,       /* 19 */
        GPIO_ADC0_ETRGREG_REMAP,       /* 20 */
        GPIO_ADC1_ETRGINS_REMAP,       /* 21 */
        GPIO_ADC1_ETRGREG_REMAP,       /* 22 */
        GPIO_ENET_REMAP,               /* 23 */
        GPIO_CAN1_REMAP,               /* 24 */
        GPIO_SWJ_NONJTRST_REMAP,       /* 25 */
        GPIO_SWJ_SWDPENABLE_REMAP,     /* 26 */
        GPIO_SWJ_DISABLE_REMAP,        /* 27 */
        GPIO_SPI2_REMAP,               /* 28 */
        GPIO_TIMER1ITI1_REMAP,         /* 29 */
        GPIO_PTP_PPS_REMAP,            /* 30 */
        GPIO_TIMER8_REMAP,             /* 31 */
        GPIO_TIMER9_REMAP,             /* 32 */
        GPIO_TIMER10_REMAP,            /* 33 */
        GPIO_TIMER12_REMAP,            /* 34 */
        GPIO_TIMER13_REMAP,            /* 35 */
        GPIO_EXMC_NADV_REMAP,          /* 36 */
};

/* GPIO MODE, see enum GD32PinMode for index values */
const int GD_GPIO_MODE[] = {
        GPIO_MODE_AIN,                /* 0 PIN_MODE_AIN */
        GPIO_MODE_IN_FLOATING,        /* 1 PIN_MODE_IN_FLOATING */
        GPIO_MODE_IPD,                /* 2 PIN_MODE_IPD */
        GPIO_MODE_IPU,                /* 3 PIN_MODE_IPU */
        GPIO_MODE_OUT_OD,             /* 4 PIN_MODE_OUT_OD */
        GPIO_MODE_OUT_PP,             /* 5 PIN_MODE_OUT_PP */
        GPIO_MODE_AF_OD,              /* 6 PIN_MODE_AF_OD */
        GPIO_MODE_AF_PP,              /* 7 PIN_MODE_AF_PP */
};

/* GPIO SPEED */
const int GD_GPIO_SPEED[] = {
        GPIO_OSPEED_50MHZ,            /* 0 */
        GPIO_OSPEED_10MHZ,            /* 1 */
        GPIO_OSPEED_2MHZ,             /* 2 */
};

#define GD_PIN_FUNCTION(mode,remap,speed,channel) ((int)((mode) & PIN_MODE_MASK) \
                        | (((remap) & PIN_REMAP_MASK) << PIN_REMAP_SHIFT)        \
                        | (((speed) & PIN_SPEED_MASK) << PIN_SPEED_SHIFT)        \
                        | (((channel) & PIN_CHANNEL_MASK) << PIN_CHANNEL_SHIFT))
#define GD_PIN_FUNCTION_ANALOG(CHN)  GD_PIN_FUNCTION(PIN_MODE_AIN, 0, 0, CHN)
#define GD_PIN_FUNCTION_REMAP(mode, remap)  GD_PIN_FUNCTION(mode, remap, 2, 0)


/* ADC PinMap */
const PinMap PinMap_ADC[] = {
        {PORTA_0, ADC0, GD_PIN_FUNCTION_ANALOG(0)},    /* ADC0_IN0 */
        {PORTA_1, ADC0, GD_PIN_FUNCTION_ANALOG(1)},    /* ADC0_IN1 */
        {PORTA_2, ADC0, GD_PIN_FUNCTION_ANALOG(2)},    /* ADC0_IN2 */
        {PORTA_3, ADC0, GD_PIN_FUNCTION_ANALOG(3)},    /* ADC0_IN3 */
        {PORTA_4, ADC0, GD_PIN_FUNCTION_ANALOG(4)},    /* ADC0_IN4 */
        {PORTA_5, ADC0, GD_PIN_FUNCTION_ANALOG(5)},    /* ADC0_IN5 */
        {PORTA_6, ADC0, GD_PIN_FUNCTION_ANALOG(6)},    /* ADC0_IN6 */
        {PORTA_7, ADC0, GD_PIN_FUNCTION_ANALOG(7)},    /* ADC0_IN7 */
        {PORTB_0, ADC0, GD_PIN_FUNCTION_ANALOG(8)},    /* ADC0_IN8 */
        {PORTB_1, ADC0, GD_PIN_FUNCTION_ANALOG(9)},    /* ADC0_IN9 */
        {PORTC_0, ADC0, GD_PIN_FUNCTION_ANALOG(10)},   /* ADC0_IN10 */
        {PORTC_1, ADC0, GD_PIN_FUNCTION_ANALOG(11)},   /* ADC0_IN11 */
        {PORTC_2, ADC0, GD_PIN_FUNCTION_ANALOG(12)},   /* ADC0_IN12 */
        {PORTC_3, ADC0, GD_PIN_FUNCTION_ANALOG(13)},   /* ADC0_IN13 */
        {PORTC_4, ADC0, GD_PIN_FUNCTION_ANALOG(14)},   /* ADC0_IN14 */
        {PORTC_5, ADC0, GD_PIN_FUNCTION_ANALOG(15)},   /* ADC0_IN15 */
        {ADC_TEMP, ADC0, GD_PIN_FUNCTION_ANALOG(16)},  /* ADC0_IN16 */
        {ADC_VREF, ADC0, GD_PIN_FUNCTION_ANALOG(17)},  /* ADC0_IN17 */

        {PORTA_0, ADC1, GD_PIN_FUNCTION_ANALOG(0)},   /* ADC1_IN0 */
        {PORTA_1, ADC1, GD_PIN_FUNCTION_ANALOG(1)},   /* ADC1_IN1 */
        {PORTA_2, ADC1, GD_PIN_FUNCTION_ANALOG(2)},   /* ADC1_IN2 */
        {PORTA_3, ADC1, GD_PIN_FUNCTION_ANALOG(3)},   /* ADC1_IN3 */
        {PORTA_4, ADC1, GD_PIN_FUNCTION_ANALOG(4)},   /* ADC1_IN4 */
        {PORTA_5, ADC1, GD_PIN_FUNCTION_ANALOG(5)},   /* ADC1_IN5 */
        {PORTA_6, ADC1, GD_PIN_FUNCTION_ANALOG(6)},   /* ADC1_IN6 */
        {PORTA_7, ADC1, GD_PIN_FUNCTION_ANALOG(7)},   /* ADC1_IN7 */
        {PORTB_0, ADC1, GD_PIN_FUNCTION_ANALOG(8)},   /* ADC1_IN8 */
        {PORTB_1, ADC1, GD_PIN_FUNCTION_ANALOG(9)},   /* ADC1_IN9 */
        {PORTC_0, ADC1, GD_PIN_FUNCTION_ANALOG(10)},  /* ADC1_IN10 */
        {PORTC_1, ADC1, GD_PIN_FUNCTION_ANALOG(11)},  /* ADC1_IN11 */
        {PORTC_2, ADC1, GD_PIN_FUNCTION_ANALOG(12)},  /* ADC1_IN12 */
        {PORTC_3, ADC1, GD_PIN_FUNCTION_ANALOG(13)},  /* ADC1_IN13 */
        {PORTC_4, ADC1, GD_PIN_FUNCTION_ANALOG(14)},  /* ADC1_IN14 */
        {PORTC_5, ADC1, GD_PIN_FUNCTION_ANALOG(15)},  /* ADC1_IN15 */

        {PORTA_0, ADC2, GD_PIN_FUNCTION_ANALOG(0)},   /* ADC2_IN0 */
        {PORTA_1, ADC2, GD_PIN_FUNCTION_ANALOG(1)},   /* ADC2_IN1 */
        {PORTA_2, ADC2, GD_PIN_FUNCTION_ANALOG(2)},   /* ADC2_IN2 */
        {PORTA_3, ADC2, GD_PIN_FUNCTION_ANALOG(3)},   /* ADC2_IN3 */
        {PORTA_4, ADC2, GD_PIN_FUNCTION_ANALOG(4)},   /* ADC2_IN4 */
        {PORTA_5, ADC2, GD_PIN_FUNCTION_ANALOG(5)},   /* ADC2_IN5 */
        {PORTA_6, ADC2, GD_PIN_FUNCTION_ANALOG(6)},   /* ADC2_IN6 */
        {PORTA_7, ADC2, GD_PIN_FUNCTION_ANALOG(7)},   /* ADC2_IN7 */
        {PORTB_0, ADC2, GD_PIN_FUNCTION_ANALOG(8)},   /* ADC2_IN8 */
        {PORTB_1, ADC2, GD_PIN_FUNCTION_ANALOG(9)},   /* ADC2_IN9 */
        {PORTC_0, ADC2, GD_PIN_FUNCTION_ANALOG(10)},  /* ADC2_IN10 */
        {PORTC_1, ADC2, GD_PIN_FUNCTION_ANALOG(11)},  /* ADC2_IN11 */
        {PORTC_2, ADC2, GD_PIN_FUNCTION_ANALOG(12)},  /* ADC2_IN12 */
        {PORTC_3, ADC2, GD_PIN_FUNCTION_ANALOG(13)},  /* ADC2_IN13 */
        {PORTC_4, ADC2, GD_PIN_FUNCTION_ANALOG(14)},  /* ADC2_IN14 */
        {PORTC_5, ADC2, GD_PIN_FUNCTION_ANALOG(15)},  /* ADC2_IN15 */
        {NC,   NC,    0}
};

/* DAC PinMap */
const PinMap PinMap_DAC[] = {
        {PORTA_4,       DAC0, GD_PIN_FUNCTION_ANALOG(0)},    /* DAC_OUT0 */
        {PORTA_5,       DAC1, GD_PIN_FUNCTION_ANALOG(1)},    /* DAC_OUT1 */
        {NC, NC, 0}
};


