vovan888/ArduinoCore-GD32/variants/BIGTREE_GD_TFT35_E3_V3_0/PeripheralPins.c
/* I2C PinMap */
const PinMap PinMap_I2C_SDA[] = {
        {PORTB_7,  I2C0, 6},
        {PORTB_9,  I2C0, 6 | (2 << 3)},    /* GPIO_I2C0_REMAP */
        {PORTB_11, I2C1, 6},
        {PORTC_9,  I2C2, 6 | (43 << 3)},    /* GPIO_PCF5_I2C2_REMAP1 */
        {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
        {PORTB_6,  I2C0, 6},
        {PORTB_8,  I2C0, 6 | (2 << 3)},    /* GPIO_I2C0_REMAP */
        {PORTB_10, I2C1, 6},
        {PORTA_8,  I2C2, 6 | (43 << 3)},   /* GPIO_PCF5_I2C2_REMAP1 */
        {NC,    NC,    0}
};

/* PWM PinMap */
// FIXME
const PinMap PinMap_PWM[] = {
        {PORTA_8,  TIMER0, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER0_CH0 - Default */
        {PORTA_9,  TIMER0, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER0_CH1 - Default */
        {PORTA_10, TIMER0, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER0_CH2 - Default */
        {PORTA_11, TIMER0, 7 | (3 << PIN_CHANNEL_SHIFT)},                      /* TIMER0_CH3 - Default */
        {PORTE_9,  TIMER0, 7 | (8 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},           /* TIMER0_CH0 - GPIO_TIMER0_FULL_REMAP */
        {PORTE_11, TIMER0, 7 | (8 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},           /* TIMER0_CH1 - GPIO_TIMER0_FULL_REMAP */
        {PORTE_13, TIMER0, 7 | (8 << PIN_REMAP_SHIFT) | (2 << PIN_CHANNEL_SHIFT)},           /* TIMER0_CH2 - GPIO_TIMER0_FULL_REMAP */
        {PORTE_14, TIMER0, 7 | (8 << PIN_REMAP_SHIFT) | (3 << PIN_CHANNEL_SHIFT)},           /* TIMER0_CH3 - GPIO_TIMER0_FULL_REMAP */

        {PORTA_0,  TIMER1, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER1_CH0_ETI - Default */
        {PORTA_1,  TIMER1, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER1_CH1_ETI - Default */
        {PORTA_2,  TIMER1, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER1_CH2_ETI - Default */
        {PORTA_3,  TIMER1, 7 | (3 << PIN_OUTPUT_MODE_SHIFT)},                      /* TIMER1_CH3_ETI - Default */
        {PORTA_15, TIMER1, 7 | (9 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},           /* TIMER1_CH0_ETI- GPIO_TIMER1_PARTIAL_REMAP0 */
        {PORTB_3,  TIMER1, 7 | (9 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},           /* TIMER1_CH1 - GPIO_TIMER1_PARTIAL_REMAP0 */
        {PORTB_10, TIMER1, 7 | (10 << PIN_REMAP_SHIFT) | (2 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH2 - GPIO_TIMER1_PARTIAL_REMAP1 */
        {PORTB_11, TIMER1, 7 | (10 << PIN_REMAP_SHIFT) | (3 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH3 - GPIO_TIMER1_PARTIAL_REMAP1 */
        {PORTA_15, TIMER1, 7 | (11 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH0_ETI - GPIO_TIMER1_FULL_REMAP */
        {PORTB_3,  TIMER1, 7 | (11 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH1 - GPIO_TIMER1_FULL_REMAP */
        {PORTB_10, TIMER1, 7 | (11 << PIN_REMAP_SHIFT) | (2 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH2 - GPIO_TIMER1_FULL_REMAP */
        {PORTB_11, TIMER1, 7 | (11 << PIN_REMAP_SHIFT) | (3 << PIN_CHANNEL_SHIFT)},          /* TIMER1_CH3 - GPIO_TIMER1_FULL_REMAP */

        {PORTA_6,  TIMER2, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER2_CH0 - Default */
        {PORTA_7,  TIMER2, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER2_CH1 - Default */
        {PORTB_0,  TIMER2, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER2_CH2 - Default */
        {PORTB_1,  TIMER2, 7 | (3 << PIN_CHANNEL_SHIFT)},                      /* TIMER2_CH3 - Default */
        {PORTB_4,  TIMER2, 7 | (12 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH0 - GPIO_TIMER2_PARTIAL_REMAP */
        {PORTB_5,  TIMER2, 7 | (12 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH1 - GPIO_TIMER2_PARTIAL_REMAP */
        {PORTC_6,  TIMER2, 7 | (13 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH0 - GPIO_TIMER2_FULL_REMAP */
        {PORTC_7,  TIMER2, 7 | (13 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH1 - GPIO_TIMER2_FULL_REMAP */
        {PORTC_8,  TIMER2, 7 | (13 << PIN_REMAP_SHIFT) | (2 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH2 - GPIO_TIMER2_FULL_REMAP */
        {PORTC_9,  TIMER2, 7 | (13 << PIN_REMAP_SHIFT) | (3 << PIN_CHANNEL_SHIFT)},          /* TIMER2_CH3 - GPIO_TIMER2_FULL_REMAP */

        {PORTB_6,  TIMER3, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER3_CH0 - Default */
        {PORTB_7,  TIMER3, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER3_CH1 - Default */
        {PORTB_8,  TIMER3, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER3_CH2 - Default */
        {PORTB_9,  TIMER3, 7 | (3 << PIN_CHANNEL_SHIFT)},                      /* TIMER3_CH3 - Default */
        {PORTD_12, TIMER3, 7 | (14 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},          /* TIMER3_CH0 - GPIO_TIMER3_REMAP */
        {PORTD_13, TIMER3, 7 | (14 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},          /* TIMER3_CH1 - GPIO_TIMER3_REMAP */
        {PORTD_14, TIMER3, 7 | (14 << PIN_REMAP_SHIFT) | (2 << PIN_CHANNEL_SHIFT)},          /* TIMER3_CH2 - GPIO_TIMER3_REMAP */
        {PORTD_15, TIMER3, 7 | (14 << PIN_REMAP_SHIFT) | (3 << PIN_CHANNEL_SHIFT)},          /* TIMER3_CH3 - GPIO_TIMER3_REMAP */

        {PORTA_0,  TIMER4, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER4_CH0 - Default */
        {PORTA_1,  TIMER4, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER4_CH1 - Default */
        {PORTA_2,  TIMER4, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER4_CH2 - Default */
        {PORTA_3,  TIMER4, 7 | (3 << PIN_CHANNEL_SHIFT)},                      /* TIMER4_CH3 - Default */

        {PORTC_6,  TIMER7, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER7_CH0 - Default */
        {PORTC_7,  TIMER7, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER7_CH1 - Default */
        {PORTC_8,  TIMER7, 7 | (2 << PIN_CHANNEL_SHIFT)},                      /* TIMER7_CH2 - Default */
        {PORTC_9,  TIMER7, 7 | (3 << PIN_CHANNEL_SHIFT)},                      /* TIMER7_CH3 - Default */

        {PORTA_2,  TIMER8, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER8_CH0 - Default */
        {PORTA_3,  TIMER8, 7 | (1 << PIN_CHANNEL_SHIFT)},                      /* TIMER8_CH1 - Default */
        {PORTE_5,  TIMER8, 7 | (33 << PIN_REMAP_SHIFT) | (0 << PIN_CHANNEL_SHIFT)},                     /* TIMER8_CH0 - GPIO_TIMER8_REMAP */
        {PORTE_6,  TIMER8, 7 | (33 << PIN_REMAP_SHIFT) | (1 << PIN_CHANNEL_SHIFT)},          /* TIMER8_CH1 - GPIO_TIMER8_REMAP */

        {PORTB_8,  TIMER9, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER9_CH0 - Default */
        {PORTB_9,  TIMER9, 7 | (0 << PIN_CHANNEL_SHIFT)},                      /* TIMER10_CH0 - Default */
        {PORTB_14,  TIMER11, 7 | (0 << PIN_CHANNEL_SHIFT)},                    /* TIMER11_CH0 - Default */
        {PORTB_15,  TIMER11, 7 | (1 << PIN_CHANNEL_SHIFT)},                    /* TIMER11_CH1 - Default */
        {NC,    NC,    0}
};

/* USART PinMap */
const PinMap PinMap_UART_TX[] = {
        {PORTA_9,  USART0, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 0)},
        {PORTA_2,  USART1, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 0)},
        {PORTD_5,  USART1, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 4)},   /* GPIO_USART1_REMAP */
        {PORTB_10, USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 0)},
        {PORTC_10, USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 5)},   /* GPIO_USART2_PARTIAL_REMAP */
        {PORTD_8,  USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 6)},   /* GPIO_USART2_FULL_REMAP */
        {PORTC_10, UART3, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 0)},
        {NC,    NC,     0}
};

const PinMap PinMap_UART_RX[] = {
        {PORTA_10, USART0, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 0)},
        {PORTA_3,  USART1, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 0)},
        {PORTD_6,  USART1, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 4)},   /* GPIO_USART1_REMAP */
        {PORTB_11, USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 0)},
        {PORTC_11, USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 5)},   /* GPIO_USART2_PARTIAL_REMAP */
        {PORTD_9,  USART2, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 6)},   /* GPIO_USART2_FULL_REMAP */
        {PORTC_11,  UART3, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 0)},
        {NC,    NC,     0}
};

// FIXME
const PinMap PinMap_UART_RTS[] = {
        {PORTA_12, USART0, 7},
        {PORTA_1,  USART1, 7},
        // {PORTD_4,  UART_1, 7 | (4 << PIN_REMAP_SHIFT)},   /* GPIO_USART1_RTS_REMAP */
        // {PORTB_14, UART_2, 7},
        // {PORTD_12, UART_2, 7 | (6 << 3)},   /* GPIO_USART2_RTS_FULL_REMAP */
        {NC,    NC,    0}
};

// FIXME
const PinMap PinMap_UART_CTS[] = {
        {PORTA_11, USART0, 7},
        {PORTA_0,  USART1, 7},
        // {PORTD_3,  UART_1, 7 | (4 << 3)},   /* GPIO_USART1_CTS_REMAP */
        // {PORTB_13, UART_2, 7},
        // {PORTD_11, UART_2, 7 | (6 << 3)},   /* GPIO_USART2_CTS_FULL_REMAP */
        {NC,    NC,    0}
};

/* SPI PinMap */
const PinMap PinMap_SPI_MOSI[] = {
        {PORTA_7,  SPI0, PIN_MODE_AF_PP},
        {PORTB_15, SPI1, PIN_MODE_AF_PP},
        {PORTC_3, SPI1, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 45)},  /* FIXME: GPIO_PCF5_SPI1_IO_REMAP1 */
        {PORTB_5, SPI2, PIN_MODE_AF_PP},
        {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
        {PORTA_6,  SPI0, PIN_MODE_IN_FLOATING},
        {PORTB_14, SPI1, PIN_MODE_IN_FLOATING},
        {PORTB_4, SPI2, GD_PIN_FUNCTION_REMAP(PIN_MODE_IN_FLOATING, 26)}, /* GPIO_SWJ_SWDPENABLE_REMAP */
        {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
        {PORTA_5,  SPI0, PIN_MODE_AF_PP},
        {PORTB_13, SPI1, PIN_MODE_AF_PP},
        {PORTB_3, SPI2, GD_PIN_FUNCTION_REMAP(PIN_MODE_AF_PP, 26)}, /* GPIO_SWJ_SWDPENABLE_REMAP */
        {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
        {PORTA_4,  SPI0, PIN_MODE_AF_PP},
        {PORTA_15, SPI0, PIN_MODE_AF_PP | (1 << PIN_REMAP_SHIFT)},    /* GPIO_SPI0_REMAP */
        {PORTB_12, SPI1, PIN_MODE_AF_PP},
        {PORTB_6, SPI2, PIN_MODE_AF_PP},
        {NC,    NC,    0}
};

/* CAN PinMap */
const PinMap PinMap_CAN_RD[] = {
        {PORTA_11, CAN0, 3},
        {PORTB_8,  CAN0, 3 | (26 << PIN_REMAP_SHIFT)},    /* GPIO_CAN0_PARTIAL_REMAP */
        {PORTD_0,  CAN0, 3 | (27 << PIN_REMAP_SHIFT)},    /* GPIO_CAN0_FULL_REMAP */
        {PORTB_12, CAN1, 3},
        {PORTB_5,  CAN1, 3 | (29 << PIN_REMAP_SHIFT)},    /* GPIO_CAN1_REMAP */
        {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
        {PORTA_12, CAN0, 7},
        {PORTB_9,  CAN0, 7 | (26 << PIN_REMAP_SHIFT)},    /* GPIO_CAN0_PARTIAL_REMAP */
        {PORTD_1,  CAN0, 7 | (27 << PIN_REMAP_SHIFT)},    /* GPIO_CAN0_FULL_REMAP */
        {PORTB_13, CAN1, 7},
        {PORTB_6,  CAN1, 7 | (29 << PIN_REMAP_SHIFT)},    /* GPIO_CAN1_REMAP */
        {NC,    NC,    0}
};
